src/cf/DataProcessors/CRM_АРМ_МоиПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<DataProcessor>
		<Properties>
			<Name>CRM_АРМ_МоиПродажи</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/Documents/CRM_Взаимодействие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>CRM_Взаимодействие</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Баллы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВзаимодействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ВидыВзаимодействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияВзаимодействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CRM_Интерес</v8:Type>
						<v8:Type>cfg:DocumentRef.CRM_Телемаркетинг</v8:Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаВесьДень</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемаяВыручка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотенциальныйКлиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКлиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеИнтереса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_СостоянияИнтересов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВзаимодействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_СостоянияСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаЗавершение</Name>
					<Comment>Используется только в календаре, для управления длительностью взаимодействия</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Первичное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.КаналыРекламныхВоздействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершившийПользователь</Name>
					<Comment>Завершивший пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/DataProcessors/CRM_АРМ_МоиПродажи/Forms/ФормаПереносаИнтересаЗавершенУспешно/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Задача") И ЗначениеЗаполнено(Параметры.Задача) Тогда
		Задача						= Параметры.Задача;
	КонецЕсли;
	
	Интерес = Параметры.Интерес;
	ОжидаемаяВыручкаУстановить = Интерес.ОжидаемаяВыручка;
	ТекущийПользователь = Пользователи.АвторизованныйПользователь();
КонецПроцедуры

&НаСервере
Функция ОбработатьИнтересНаСервере()
	
	Результат = Новый Структура("Успех, Сообщение, Взаимодействие");
	// обработка интереса
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_Взаимодействие.Ссылка
	|ИЗ
	|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
	|ГДЕ
	|	CRM_Взаимодействие.ДокументОснование = &Интерес
	|	И CRM_Взаимодействие.СтатусВзаимодействия <> ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Отменено)
	|	И CRM_Взаимодействие.СтатусВзаимодействия <> ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
	|
	|УПОРЯДОЧИТЬ ПО
	|	CRM_Взаимодействие.ПлановаяДата УБЫВ";
	Запрос.УстановитьПараметр("Интерес", Интерес);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Первое = Истина;
	
	Попытка
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ВзаимодействиеОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			Если Первое Тогда
				ВзаимодействиеОбъект.Результат = РезультатТекущегоВзаимодействия;
				ВзаимодействиеОбъект.СостояниеИнтереса = Справочники.CRM_СостоянияИнтересов.ИнтересЗакрыт;
				ВзаимодействиеОбъект.ДатаЗавершенияВзаимодействия = ТекущаяДатаСеанса();
				ВзаимодействиеОбъект.ЗавершившийПользователь = Пользователи.ТекущийПользователь();
				ВзаимодействиеОбъект.ОжидаемаяВыручка = ОжидаемаяВыручкаУстановить;
				ВзаимодействиеОбъект.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено;
				ВзаимодействиеОбъект.Записать();
				
				Если ЗначениеЗаполнено(ВзаимодействиеОбъект.Задача) Тогда
					ЗадачаОбъект = ВзаимодействиеОбъект.Задача.ПолучитьОбъект();
					ДатаСтрокой = CRM_БизнесПроцессыПереопределяемый.ПолучитьПредставлениеДатыДействия(ВзаимодействиеОбъект.ДатаЗавершенияВзаимодействия);
					
					ПоследнееДействиеСтрокой = ДатаСтрокой+" "+НСтр("ru = 'Завешнено взаимодействие"""+ВзаимодействиеОбъект.ВидВзаимодействия+""" -> '") + Строка(ВзаимодействиеОбъект.Ответственный);
					
					Если ПоследнееДействиеСтрокой = ЗадачаОбъект.CRM_ПоследнееДействиеСтрокой Тогда
						СтрокаДляЗамены = ПоследнееДействиеСтрокой + Символы.ПС + ВзаимодействиеОбъект.Результат + Символы.ПС;
						ЗадачаОбъект.РезультатВыполнения = СтрЗаменить(ЗадачаОбъект.РезультатВыполнения,ПоследнееДействиеСтрокой + Символы.ПС,СтрокаДляЗамены);
					Иначе
						ЗадачаОбъект.CRM_ПоследнееДействиеСтрокой = ПоследнееДействиеСтрокой;
						
						ЗадачаОбъект.РезультатВыполнения = ПоследнееДействиеСтрокой + Символы.ПС + ВзаимодействиеОбъект.Результат + ?(ПустаяСтрока(ЗадачаОбъект.РезультатВыполнения),"",Символы.ПС) + "
						|"+ЗадачаОбъект.РезультатВыполнения;
					КонецЕсли;
					ЗадачаОбъект.Записать();
					
					ПараметрыДосрочногоЗавершения = Новый Структура();
					ПараметрыДосрочногоЗавершения.Вставить("ЗавершенДосрочно"				,Истина);
					ПараметрыДосрочногоЗавершения.Вставить("ПричинаДосрочногоЗавершения"	,Справочники.CRM_ПричиныОтказов.ПустаяСсылка());
					ПараметрыДосрочногоЗавершения.Вставить("Задача"							,ЗадачаОбъект.Ссылка);
					ПараметрыДосрочногоЗавершения.Вставить("ЭтапДосрочногоЗавершения"	,ЗадачаОбъект.CRM_ТочкаМаршрута);
					ПараметрыДосрочногоЗавершения.Вставить("ВариантЗавершения"			,Справочники.CRM_ВариантыЗавершенияБизнесПроцесса.Успешно);
					
					CRM_БизнесПроцессыСервер.ЗавершитьДосрочноБизнесПроцесс(ПараметрыДосрочногоЗавершения);
				КонецЕсли;
			Иначе
				ВзаимодействиеОбъект.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Отменено;
				ВзаимодействиеОбъект.Записать();
			КонецЕсли;
			Первое = Ложь;
		КонецЦикла;
		
		ИнтересОбъект = Интерес.ПолучитьОбъект();
		ИнтересОбъект.ОжидаемаяВыручка = ОжидаемаяВыручкаУстановить;
		ИнтересОбъект.СостояниеИнтереса = Справочники.CRM_СостоянияИнтересов.ИнтересЗакрыт;
		ИнтересОбъект.Завершен = Истина;
		ИнтересОбъект.ДатаЗакрытия = ТекущаяДатаСеанса();
		ИнтересОбъект.Записать();
		
		Результат.Взаимодействие = Интерес;
		Результат.Успех = Истина;
	Исключение
		Результат.Взаимодействие = Неопределено;
		Результат.Успех = Ложь;
		Результат.Сообщение = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Обработать(Команда)
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	Результат = ОбработатьИнтересНаСервере();
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры
